Zadání
Úkol můžeš odevzdat buďto jako Jupyter Notebook .ipynb, nebo jako klasický program .py.

Část 1
Uvažuj, že zpracováváš analýzu pro softwarovou firmu. Firma má kanceláře v Praze, Plzni a Liberci. Seznam zaměstnanců pro jednotlivé kanceláře najdeš v souborech zam_praha.csv, zam_plzeň.csv a zam_liberec.csv.

1. Načti data o zaměstnancích z CSV souborů do tabulek (DataFrame). Ke každé tabulce přidej nový sloupec mesto, které bude obsahovat informaci o tom, ve kterém městě zaměstnanec pracuje.

In [8]:
import pandas as pd

#1 načtení dat = 3 tabulky
praha = pd.read_csv("zam_praha.txt", sep=",")
plzen = pd.read_csv("zam_plzeň.txt", sep=",")
liberec = pd.read_csv("zam_liberec.txt", sep=",")
praha.shape

(29, 4)

In [9]:
plzen.shape

(16, 4)

In [10]:
liberec.shape

(11, 4)

In [14]:
#1 Vytvoření nového sloupce "Město" v každé tabulce
praha["Město"] = "Praha"
plzen["Město"] = "Plzeň"
liberec["Město"] = "Liberec"

2. Vytvoř novou tabulku zamestnanci a ulož do ní informace o všech zaměstnancích (operace concat).

In [15]:
#2
zamestnanci = pd.concat([praha, plzen, liberec])
zamestnanci.head()

      jmeno prijimeni   telefonni_cislo  cislo_zamestnance  Město
0     Brian      Hall  +421 949 656 098                 30  Praha
1     Marta  Kolářová       730 456 163                 32  Praha
2      John   Moravec       725 092 179                 33  Praha
3  Dominika   Kopecká       722 747 626                 34  Praha
4    Marcel     Hájek  +421 902 928 669                 35  Praha

In [16]:
#ověření kolik má nově řádků a sloupců
zamestnanci.shape

(56, 5)

3. Ze souboru platy_2021_02.csv načti platy zaměstnanců za únor 2021. Propoj tabulku (operace join) s platy a tabulku se zaměstnanci pomocí sloupce cislo_zamestnance.

In [17]:
#3
platy_2021 = pd.read_csv("platy_2021_02.txt", sep=",")
platy_2021.head()

   cislo_zamestnance     plat
0                  3  54900.0
1                  6  54800.0
2                  7  36400.0
3                  8  47900.0
4                 16  34200.0

In [25]:
zamestnanci_plat = pd.merge(zamestnanci, platy_2021, how="inner", on=["cislo_zamestnance"])  #inner ponechává jen řádky s obsahem, kdybych použila outer, zůstanou tam komplet všechny řádky
zamestnanci_plat.head()

      jmeno  prijimeni   telefonni_cislo  cislo_zamestnance  Město     plat
0     Brian       Hall  +421 949 656 098                 30  Praha  33500.0
1     Marta   Kolářová       730 456 163                 32  Praha  53000.0
2      John    Moravec       725 092 179                 33  Praha  38400.0
3  Dominika    Kopecká       722 747 626                 34  Praha  36800.0
4    Milada  Hernandez       773 373 704                 38  Praha  32600.0

4. Porovnej rozměry tabulek před spojením a po spojení. Pokud nemá některý zaměstnanec plat za únor, znamená to, že v naší firmě již nepracuje.

In [26]:
#4
print(zamestnanci.shape)
#print(platy_2021.shape) #jen pro zajímavost
print(zamestnanci_plat.shape)

(56, 5)
(43, 6)

5. Spočti průměrný plat zaměstnanců v jednotlivých kancelářích.

In [30]:
zamestnanci_plat.groupby("Město")["plat"].mean().round(1) #přídáno zaokrouhlení na 1 desetinné místo

Město
Liberec    43775.0
Plzeň      44792.9
Praha      43295.2
Name: plat, dtype: float64

Část 2
Pokračuj ve své práci pro softwarovou firmu. Ze souboru vykazy.csv načti informace o výkazech na projekty pro jednoho vybraného zákazníka.

1. Načti data ze souboru a ulož je do tabulky.

In [36]:
vykazy = pd.read_csv("vykazy.txt",sep=",")
vykazy

          date  hours project  emloyee_id
0   2021-02-01    2.5     F30          13
1   2021-02-01    3.4     W05          70
2   2021-02-01    2.1     JL9          72
3   2021-02-01    5.2     F30           3
4   2021-02-01    2.4     TE1          54
5   2021-02-01    4.1     TE1          83
6   2021-02-01    5.4     W05          92
7   2021-02-01    2.2     YLI          34
8   2021-02-01    2.7     YLI          84
9   2021-02-01    4.4     W05          30
10  2021-02-02    5.6     F30          53
11  2021-02-02    2.6     W05          47
12  2021-02-02    2.4     YLI          44
13  2021-02-02    3.1     YLI          40
14  2021-02-02    5.3     YLI          10
15  2021-02-02    3.6     YLI          53
16  2021-02-02    5.6     F30          56
17  2021-02-03    4.0     W05          53
18  2021-02-03    4.6     TE1          86
19  2021-02-03    2.6     F30          18
20  2021-02-03    2.8     TE1          47
21  2021-02-03    2.6     YLI          34
22  2021-02-03    3.7     YLI          96
23  2021-02-03    5.2     W05          57
24  2021-02-03    5.5     W05          40
25  2021-02-03    5.4     YLI          86
26  2021-02-03    2.1     TE1          87

2. Proveď agregaci a zjisti celkový počet vykázaných hodin za jednotlivé projekty.

In [37]:
celkovy_pocet_hodin = vykazy.groupby("project")["hours"].sum()
print(celkovy_pocet_hodin)

project
F30    21.5
JL9     2.1
TE1    16.0
W05    30.5
YLI    31.0
Name: hours, dtype: float64